{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_1", "strides": [2, 2], "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "kernel_size": [5, 5], "kernel_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 100, 320, 1], "kernel_constraint": null, "use_bias": true, "padding": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_2", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "filters": 36, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_3", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_4", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_5", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_6", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_7", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 100, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 50, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 10, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 3, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}], "keras_version": "2.0.6", "backend": "tensorflow"}