{"backend": "tensorflow", "config": [{"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 100, 320, 1], "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "valid", "name": "conv2d_1", "strides": [2, 2], "filters": 24, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "strides": [2, 2], "filters": 36, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "strides": [2, 2], "filters": 48, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "strides": [1, 1], "filters": 64, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_5", "strides": [1, 1], "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_6", "strides": [1, 1], "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_7", "strides": [1, 1], "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 100, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 50, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 10, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 3, "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential"}