{"backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 240, 320, 3], "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "filters": 24, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [2, 2], "padding": "valid", "bias_constraint": null, "filters": 36, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [2, 2], "padding": "valid", "bias_constraint": null, "filters": 48, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "valid", "bias_constraint": null, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "valid", "bias_constraint": null, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "valid", "bias_constraint": null, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 100, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 50, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 10, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 3, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential"}