{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 240, 320, 3], "name": "lambda_1", "dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faH/home/misiu/src/self-driving/mini-self-driving-car/src/ml/train_model.py\u00da\b<lambda>{\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "activation": "linear", "filters": 24, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "activation": "linear", "filters": 36, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "filters": 48, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "activation": "linear", "filters": 64, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_5", "kernel_constraint": null, "activation": "linear", "filters": 64, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 100, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 50, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 10, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 3, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}], "keras_version": "2.0.6"}
