{"config": [{"config": {"arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faH/home/misiu/src/self-driving/mini-self-driving-car/src/ml/train_model.py\u00da\b<lambda>{\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dtype": "float32", "output_shape": null, "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 240, 320, 3], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 24, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "name": "conv2d_1", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 36, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 48, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "name": "conv2d_3", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_4", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_5", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 100, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 50, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 10, "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 3, "name": "dense_4", "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}