{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 240, 320, 3], "name": "conv2d_1", "bias_regularizer": null, "strides": [2, 2], "filters": 24, "dilation_rate": [1, 1], "padding": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "strides": [2, 2], "filters": 36, "dilation_rate": [1, 1], "padding": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "strides": [2, 2], "filters": 48, "dilation_rate": [1, 1], "padding": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "padding": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "padding": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 100, "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 50, "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 10, "use_bias": true, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "units": 3, "use_bias": true, "bias_constraint": null, "name": "dense_4", "bias_regularizer": null}}], "backend": "tensorflow"}