{"config": [{"config": {"use_bias": true, "trainable": true, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 100, 320, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 24, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 36, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "name": "conv2d_3", "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 48, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "linear", "name": "conv2d_4", "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "linear", "name": "conv2d_5", "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "linear", "name": "conv2d_6", "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "activation": "linear", "name": "conv2d_7", "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_constraint": null, "units": 100, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "bias_constraint": null, "units": 50, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"use_bias": true, "bias_constraint": null, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "units": 3, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}